blog/2021/no-one-way-to-solve-all-problems.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-08 Tue 14:01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>没有一劳永逸的办法</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">没有一劳永逸的办法</h1>
</header><p>
昨天，我想花时间，找到一种方法-&#x2013;&#x2014;它能帮助我筛选出优质的信息源。但是，我没有找到这种方法。晚上的读书会交流，让我明白：没有一劳永逸的办法。不是说，我找到了一种方法，按照这个方法，我就能够找到我想到的优质信息源。寻找优质信息源这件事是需要长期专注的，也就是说，我需要不断调整我的信息渠道，随时更新的信息源。
</p>

<p>
由此及彼，我开始意识到这样的问题：自己总会有意无意地找这样的方法，希冀通过这种方法获得某种实质性的改变，但是除了当时自我感觉良好外，之后我并没有任何进步。我没有作出改变。为什么？因为别人的方法并不一定适合我，我需要不断地尝试、磨合、训练，最后形成一个我自己的方法，我能够用这个方法解决我现在遇到的一个问题。
</p>

<p>
但是，问题不会永远不变，所以解决问题的办法也要改变。我的方法并不总是适用，怎么办？找到新旧问题间的异同，把旧有的办法经过修改迁移到新问题中。
</p>
</div>
</body>
</html>